###### Pandas
###### Pandas is built on top of numpy so it gets all the benefits of numpy slicing, maksing, speed,...

In [1]:
import pandas as pd

###### Pandas Series(1D array)

In [2]:
A = pd.Series([1,2,3,4], index=['a','b','c','d']) #think of these indices and value like dictionary

In [3]:
A

a    1
b    2
c    3
d    4
dtype: int64

In [4]:
type(A)

pandas.core.series.Series

In [5]:
A.values

array([1, 2, 3, 4], dtype=int64)

In [6]:
type(A.values)

numpy.ndarray

In [7]:
type(A.index)

pandas.core.indexes.base.Index

In [8]:
A['a']

1

In [10]:
A['a':'c'] #both are inclusive here

a    1
b    2
c    3
dtype: int64

In [16]:
A = pd.Series([1,2,3,4], index= ['a','c','z','g'])

In [17]:
A.index

Index(['a', 'c', 'z', 'g'], dtype='object')

In [18]:
A['c']

2

In [20]:
A['a':'g'] #it will not take into account lexical sequence it will just go through all indices available till end is reached(incl.)

a    1
c    2
z    3
g    4
dtype: int64

###### Creating Series from dictionary

In [21]:
A = {'A': -1, 'B': -4, 'C': 6}

In [22]:
A_series = pd.Series(A)

In [23]:
A_series.values

array([-1, -4,  6], dtype=int64)

In [26]:
A_series.count()

3

In [27]:
A_series.index

Index(['A', 'B', 'C'], dtype='object')

In [36]:
A = {1.2 : 1, 3.5 : 1, 7.8: 9} #indices needn't be just strings

In [37]:
A_ser = pd.Series(A)

In [38]:
A_ser.values

array([1, 1, 9], dtype=int64)

In [39]:
A_ser.count()

3

In [40]:
A_ser.index

Float64Index([1.2, 3.5, 7.8], dtype='float64')

In [41]:
A_ser.value_counts()

1    2
9    1
dtype: int64

In [44]:
A_ser[0::] #pandas may get confused if indices are numerical and same as give number(int and have similar numbers)

1.2    1
3.5    1
7.8    9
dtype: int64

###### Data Frame

In [58]:
pd.DataFrame?

In [59]:
A = {1 : 'dog', 2: 'cat', 3: 'girraffe'}
B = {'a': 'super', 'b': 'duper' , 'c' : 'amazing'}

df = pd.DataFrame(A,B) #A - data and B - index

In [60]:
df

     1    2         3
a  dog  cat  girraffe
b  dog  cat  girraffe
c  dog  cat  girraffe

In [53]:
A = {'a' : 100, 'b' : 200}
B = {'1' : 'xyz', '2' : 'op'}

df = pd.DataFrame(A,index = ['a','b']) #we are using a and b as indices but still storing same value in both

In [51]:
df

     a    b
1  100  200
2  100  200

In [54]:
df = pd.DataFrame(A,index = ['1','2'])

In [55]:
df

     a    b
1  100  200
2  100  200

In [62]:
A = {1 : 'dog', 2: 'cat', 3: 'girraffe'}
B = {1: 'super', 2: 'duper' , 3 : 'amazing'}

df = pd.DataFrame({'animals':A, 'quality': B})

In [63]:
df

    animals  quality
1       dog    super
2       cat    duper
3  girraffe  amazing

In [64]:
df.T

             1      2         3
animals    dog    cat  girraffe
quality  super  duper   amazing

In [65]:
df.columns

Index(['animals', 'quality'], dtype='object')

In [66]:
df.values

array([['dog', 'super'],
       ['cat', 'duper'],
       ['girraffe', 'amazing']], dtype=object)

In [67]:
type(df.values)

numpy.ndarray

In [69]:
df.values[0,1]

'super'

In [70]:
df

    animals  quality
1       dog    super
2       cat    duper
3  girraffe  amazing

In [72]:
df['nickname'] = ''

In [73]:
df

    animals  quality nickname
1       dog    super
2       cat    duper
3  girraffe  amazing

In [83]:
df

    animals  quality nickname
1       dog    super
2       cat    duper
3  girraffe  amazing

In [87]:
df['nickname'] = df['quality'].add_prefix('a')

In [88]:
df

    animals  quality nickname
1       dog    super      NaN
2       cat    duper      NaN
3  girraffe  amazing      NaN

In [ ]:
del df['nickname']

In [7]:
A = {1: 85, 2:75,3:65}

df = pd.DataFrame({'grades': A})

In [8]:
df

   grades
1      85
2      75
3      65

In [9]:
D = df[df<70]

In [10]:
D

   grades
1     NaN
2     NaN
3    65.0

In [11]:
D = df[df['grades']<70]

In [12]:
D

   grades
3      65

In [13]:
df = pd.DataFrame([{'a':1, 'b':2},{'b':3, 'c':4}])

In [14]:
df

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [15]:
#NaN and None are used interchangably
df.isnull()

       a      b      c
0  False  False   True
1   True  False  False

###### Replacing null values

In [16]:
df.isnull().sum()

a    1
b    0
c    1
dtype: int64

In [18]:
df.dropna() #drops all records with na

Empty DataFrame
Columns: [a, b, c]
Index: []

In [19]:
df = pd.DataFrame([{'a':1, 'b':2},{'b':3, 'c':4}])

In [25]:
#fillna(value) or replace(np.nan, replacement_value, inplace=boolean value)

df.sum()

a    1.0
b    5.0
c    4.0
dtype: float64

In [27]:
total_sum = df.sum().sum()

In [30]:
size = df.size

In [32]:
df.fillna(total_sum/size)

          a  b         c
0  1.000000  2  1.666667
1  1.666667  3  4.000000

###### Indexing
###### for implicit indices use A.iloc[1:3]
###### for explicit indices use A.loc[1:3]